package com.ecmp.annotation;

import java.lang.annotation.*;

/**
 * *************************************************************************************************
 * <br>
 * 实现功能：
 * <br>
 * 该注解用于API接口类上，以此获取对应应用模块的接口基地址
 * ------------------------------------------------------------------------------------------------
 * <br>
 * 版本          变更时间             变更人                     变更原因
 * <br>
 * ------------------------------------------------------------------------------------------------
 * <br>
 * 1.0.00      2017/5/15 10:59      马超(Vision.Mac)                新建
 * <br>
 * *************************************************************************************************
 */
@Documented
@Retention(RetentionPolicy.RUNTIME)
@Target({ElementType.TYPE})
public @interface AppModule {
    /**
     * 系统应用模块代码
     */
    String value();
}
