package com.ecmp.annotation;

import java.lang.annotation.*;

/**
 * *************************************************************************************************
 * <br>
 * 实现功能：
 * <br>
 * 平台默认检查权限，该注解用于一些不许进行权限检查的方法或类上
 * ------------------------------------------------------------------------------------------------
 * <br>
 * 版本          变更时间             变更人                     变更原因
 * <br>
 * ------------------------------------------------------------------------------------------------
 * <br>
 * 1.0.00      2017/5/15 10:59      马超(Vision.Mac)                新建
 * <br>
 * *************************************************************************************************
 */
@Documented
@Retention(RetentionPolicy.RUNTIME)
@Target({ElementType.TYPE, ElementType.METHOD})
public @interface IgnoreCheckAuth {

//    boolean value() default true;
}
