package com.ecmp.annotation;

import java.lang.annotation.*;

/**
 * *************************************************************************************************<br>
 * <br>
 * 实现功能：<br>
 *     用于注解类或属性的备注数据，这些元数据用于运行时动态内容生成
 * <br>
 * ------------------------------------------------------------------------------------------------<br>
 * 版本          变更时间             变更人                     变更原因<br>
 * ------------------------------------------------------------------------------------------------<br>
 * 1.0.00      2017/4/27 13:47      马超(Vision.Mac)                新建<br>
 * <br>
 * *************************************************************************************************<br>
 */
@Documented
@Retention(RetentionPolicy.RUNTIME)
@Target({ ElementType.TYPE, ElementType.FIELD, ElementType.METHOD, ElementType.PACKAGE })
public @interface Remark {
    /**
     * 简要注解说明
     */
    String value();

    /**
     * 注释说明：用于描述代码内部用法说明，一般不用于业务
     */
    String comments() default "";
}
